; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_8 ?v13 ?v2)
             (pred_1 ?v8 ?v6)
             (pred_3 ?v13 ?v6)
             (pred_12 ?v12 ?v13 )
	     (pred_11 ?v13)
             (pred_2 ?v1)
             (pred_6 ?v8)
             (pred_9 ?v6)
             (pred_7 ?v13)
             (pred_4 ?v8)
             (pred_5 ?v13)
             (pred_10 ))



(:action op_3
:parameters (?v10 ?v9 ?v11 ?v4)
:precondition (and (pred_2 ?v10) (pred_2 ?v9) (pred_6 ?v11) (pred_9 ?v4)
          (pred_8 ?v10 ?v9) (pred_1 ?v11 ?v4)
                   (pred_3 ?v9 ?v4) (pred_11 ?v10) 
                   (pred_7 ?v9) (pred_4 ?v11))
:effect (and  (pred_5 ?v9) (not (pred_7 ?v9))))


(:action op_2
:parameters (?v10 ?v7)
:precondition (and (pred_2 ?v10) (pred_2 ?v7)
               (pred_11 ?v10) (pred_8 ?v10 ?v7) (pred_5 ?v7))
:effect (and (pred_11 ?v7) (not (pred_11 ?v10))))

(:action op_1
:parameters (?v10 ?v11)
:precondition (and (pred_2 ?v10) (pred_6 ?v11) 
                  (pred_11 ?v10) (pred_12 ?v11 ?v10) (pred_10 ))
:effect (and (pred_4 ?v11)
   (not (pred_12 ?v11 ?v10)) (not (pred_10 ))))


(:action op_5
:parameters (?v10 ?v5 ?v3)
:precondition (and (pred_2 ?v10) (pred_6 ?v5) (pred_6 ?v3)
                  (pred_11 ?v10) (pred_4 ?v3) (pred_12 ?v5 ?v10))
:effect (and (pred_4 ?v5) (pred_12 ?v3 ?v10)
        (not (pred_4 ?v3)) (not (pred_12 ?v5 ?v10))))

(:action op_4
:parameters (?v10 ?v11)
:precondition (and (pred_2 ?v10) (pred_6 ?v11) 
                  (pred_11 ?v10) (pred_4 ?v11))
:effect (and (pred_10 ) (pred_12 ?v11 ?v10) (not (pred_4 ?v11)))))

; problem
(define (problem grid-5-5-2-3-3)
    (:domain grid)
    (:objects
    obj_13 obj_08 obj_28 obj_21 obj_19 obj_26 obj_23 obj_09 obj_11 obj_10 obj_12 obj_22 obj_25 obj_20 obj_18 obj_17 obj_02 obj_24 obj_14 obj_29 obj_15 obj_16 obj_03 obj_04 obj_05
    obj_06 obj_07
    obj_01 obj_27 obj_30
    )

    (:init
       (pred_10)

       (pred_2 obj_13)
       (pred_2 obj_08)
       (pred_2 obj_28)
       (pred_2 obj_21)
       (pred_2 obj_19)
       (pred_2 obj_26)
       (pred_2 obj_23)
       (pred_2 obj_09)
       (pred_2 obj_11)
       (pred_2 obj_10)
       (pred_2 obj_12)
       (pred_2 obj_22)
       (pred_2 obj_25)
       (pred_2 obj_20)
       (pred_2 obj_18)
       (pred_2 obj_17)
       (pred_2 obj_02)
       (pred_2 obj_24)
       (pred_2 obj_14)
       (pred_2 obj_29)
       (pred_2 obj_15)
       (pred_2 obj_16)
       (pred_2 obj_03)
       (pred_2 obj_04)
       (pred_2 obj_05)
       (pred_9 obj_06)
       (pred_9 obj_07)
       (pred_6 obj_01)
       (pred_6 obj_27)
       (pred_6 obj_30)

       (pred_8 obj_13 obj_26)
       (pred_8 obj_13 obj_08)
       (pred_8 obj_08 obj_23)
       (pred_8 obj_08 obj_28)
       (pred_8 obj_08 obj_13)
       (pred_8 obj_28 obj_09)
       (pred_8 obj_28 obj_21)
       (pred_8 obj_28 obj_08)
       (pred_8 obj_21 obj_11)
       (pred_8 obj_21 obj_19)
       (pred_8 obj_21 obj_28)
       (pred_8 obj_19 obj_10)
       (pred_8 obj_19 obj_21)
       (pred_8 obj_26 obj_12)
       (pred_8 obj_26 obj_23)
       (pred_8 obj_26 obj_13)
       (pred_8 obj_23 obj_22)
       (pred_8 obj_23 obj_09)
       (pred_8 obj_23 obj_08)
       (pred_8 obj_23 obj_26)
       (pred_8 obj_09 obj_25)
       (pred_8 obj_09 obj_11)
       (pred_8 obj_09 obj_28)
       (pred_8 obj_09 obj_23)
       (pred_8 obj_11 obj_20)
       (pred_8 obj_11 obj_10)
       (pred_8 obj_11 obj_21)
       (pred_8 obj_11 obj_09)
       (pred_8 obj_10 obj_18)
       (pred_8 obj_10 obj_19)
       (pred_8 obj_10 obj_11)
       (pred_8 obj_12 obj_17)
       (pred_8 obj_12 obj_22)
       (pred_8 obj_12 obj_26)
       (pred_8 obj_22 obj_02)
       (pred_8 obj_22 obj_25)
       (pred_8 obj_22 obj_23)
       (pred_8 obj_22 obj_12)
       (pred_8 obj_25 obj_24)
       (pred_8 obj_25 obj_20)
       (pred_8 obj_25 obj_09)
       (pred_8 obj_25 obj_22)
       (pred_8 obj_20 obj_14)
       (pred_8 obj_20 obj_18)
       (pred_8 obj_20 obj_11)
       (pred_8 obj_20 obj_25)
       (pred_8 obj_18 obj_29)
       (pred_8 obj_18 obj_10)
       (pred_8 obj_18 obj_20)
       (pred_8 obj_17 obj_15)
       (pred_8 obj_17 obj_02)
       (pred_8 obj_17 obj_12)
       (pred_8 obj_02 obj_16)
       (pred_8 obj_02 obj_24)
       (pred_8 obj_02 obj_22)
       (pred_8 obj_02 obj_17)
       (pred_8 obj_24 obj_03)
       (pred_8 obj_24 obj_14)
       (pred_8 obj_24 obj_25)
       (pred_8 obj_24 obj_02)
       (pred_8 obj_14 obj_04)
       (pred_8 obj_14 obj_29)
       (pred_8 obj_14 obj_20)
       (pred_8 obj_14 obj_24)
       (pred_8 obj_29 obj_05)
       (pred_8 obj_29 obj_18)
       (pred_8 obj_29 obj_14)
       (pred_8 obj_15 obj_16)
       (pred_8 obj_15 obj_17)
       (pred_8 obj_16 obj_03)
       (pred_8 obj_16 obj_02)
       (pred_8 obj_16 obj_15)
       (pred_8 obj_03 obj_04)
       (pred_8 obj_03 obj_24)
       (pred_8 obj_03 obj_16)
       (pred_8 obj_04 obj_05)
       (pred_8 obj_04 obj_14)
       (pred_8 obj_04 obj_03)
       (pred_8 obj_05 obj_29)
       (pred_8 obj_05 obj_04)
       (pred_7 obj_08)
       (pred_7 obj_23)
       (pred_7 obj_29)
       (pred_3  obj_08 obj_06)
       (pred_3  obj_23 obj_07)
       (pred_3  obj_29 obj_07)
       (pred_5 obj_13)
       (pred_5 obj_28)
       (pred_5 obj_21)
       (pred_5 obj_19)
       (pred_5 obj_26)
       (pred_5 obj_09)
       (pred_5 obj_11)
       (pred_5 obj_10)
       (pred_5 obj_12)
       (pred_5 obj_22)
       (pred_5 obj_25)
       (pred_5 obj_20)
       (pred_5 obj_18)
       (pred_5 obj_17)
       (pred_5 obj_02)
       (pred_5 obj_24)
       (pred_5 obj_14)
       (pred_5 obj_15)
       (pred_5 obj_16)
       (pred_5 obj_03)
       (pred_5 obj_04)
       (pred_5 obj_05)

       (pred_1  obj_01 obj_06)
       (pred_1  obj_27 obj_07)
       (pred_1  obj_30 obj_06)
       (pred_12 obj_01 obj_13)
       (pred_12 obj_27 obj_24)
       (pred_12 obj_30 obj_13)
       (pred_11 obj_16)
    )

    (:goal (and
       (pred_12 obj_27 obj_19)
    ))
(:constraints
  (always (not (pred_11 obj_02)))
)
)

; plan
1. (op_2 obj_16 obj_03)
   deleted: (pred_11 obj_16)
   added: (pred_11 obj_03)
   goals met: 0 of 1
2. (op_2 obj_03 obj_24)
   deleted: (pred_11 obj_03)
   added: (pred_11 obj_24)
   goals met: 0 of 1
3. (op_1 obj_24 obj_27)
   deleted: (pred_12 obj_27 obj_24) (pred_10)
   added: (pred_4 obj_27)
   goals met: 0 of 1
4. (op_2 obj_24 obj_25)
   deleted: (pred_11 obj_24)
   added: (pred_11 obj_25)
   goals met: 0 of 1
5. (op_2 obj_25 obj_09)
   deleted: (pred_11 obj_25)
   added: (pred_11 obj_09)
   goals met: 0 of 1
6. (op_2 obj_09 obj_28)
   deleted: (pred_11 obj_09)
   added: (pred_11 obj_28)
   goals met: 0 of 1
7. (op_2 obj_28 obj_21)
   deleted: (pred_11 obj_28)
   added: (pred_11 obj_21)
   goals met: 0 of 1
8. (op_2 obj_21 obj_19)
   deleted: (pred_11 obj_21)
   added: (pred_11 obj_19)
   goals met: 0 of 1
9. (op_4 obj_19 obj_27)
   deleted: (pred_4 obj_27)
   added: (pred_10) (pred_12 obj_27 obj_19)
   goals met: 1 of 1
